
; використовується процесор з ядром і586 і вище
.586

.model flat 

; flat - вказує на те, що всі сегменти розміщені фізично в одному сегменті

; Узгодження, які використовує лінкер для мови С передбачають:
; 1. аргументи функціям передаються через стек;
; 2. викликаюча функція очищає стек від параметрів;
; 3. аргументи завантажуються в стек перед викликом функції справа на ліво;
; 4. імена ідентифікаторів мають префікс "підкреслення" (_);
; 5. імена ідентифікаторів є регістрозалежними (є різниця між великими і малими буквами);
; 6. функції повертають значення в регістропару eax:edx.

EXTRN _nNumber1:dword
PUBLIC _weightedsum

.data
	; оскільки Weight це локальна для func.asm змінна, 
; то вона може не відповідати узгодженням для мови С 
Weight dd 5
.code
	
	; Процедура _weightedsum має 2 параметри і використовує узгодження мови С
	_weightedsum PROC ; ближня процедура
	
	; в стеку на даний момент є 32-ох розрядна ближня адреса пвернення з процедури
	; збережемо в стек 32-ох розрядне значення ebp	
		push ebp
		mov ebp,esp
	
; доступаємося до першого параметру	який має відносно esp зміщення +8 байт
		mov eax,[ebp+12]
	
; доступаємося до другого параметру який має відносно esp зміщення +12 байт
		mov edx,[ebp+8]
		add  eax,edx
		add  eax,_nNumber1
		mul  Weight
	; результат виконання занесено в eax
	
		pop ebp
		ret
		
	_weightedsum endp
end
